user_questions = [
    {
        " 1.Запросить данные с сайта HEAD HUNTER\n": "1",
        "2.Запросить данные с сайта SUPER JOB\n": "2",
        "3.Работа с файлом\n": "3",
        "4.Работа с вакансиями\n": "4",
        "5.Завершить обработку": "5"
     },
    {
        " 1.Выбор данных их файла\n": "1",
        "2.Удаление данных их файла\n": "2",
        "3.Полная сортировка данных файла\n": "3",
        "4.Выйти в команды верхнего меню\n": "4"
     },
    {
         " 1.Вывести N самых высокооплачиваемые вакансии\n": "1",
         "2.Глубокий поиск по вакансиям\n": "2",
         "3.Выйти в команды верхнего меню\n": "3"
     },
    {
        "! Некорректная команда ввода !\n": "1"
    }

]

"""Работа с файлом"""
user_search = {
    " 1.Поле:'name'          - название вакансии\n": "1",
    "2.Поле:'url'          - ссылка на вакансию\n": "2",
    "3.Поле:'responsibility'         - описание \n": "3",
    "4.Поле:'town'                      - город\n": "4",
    "5.Поле:'employer'   - название организации\n": "5",
    "6.Поле:'requirement'          - требования\n": "6",
    "7.Поле:'salary_from'               - ЗП от\n": "7",
    "8.Поле:'salary_to'                 - ЗП до\n": "8"
    }
user_search_answers = {
    "1": "name",
    "2": "url",
    "3": "responsibility",
    "4": "town",
    "5": "employer",
    "6": "requirement",
    "7": "salary_from",
    "8": "salary_to"
    }

"""Полная сортировка данных файла"""
user_search_sorted = {
    " 1.Название вакансии\n": "1",
    "2.Город\n": "2",
    "3.Название организации\n": "3",
    "4.ЗП от\n": "4",
    "5.ЗП до\n": "5"
    }
user_search_sorted_answers = {
    "1": "name",
    "2": "town",
    "3": "employer",
    "4": "salary_from",
    "5": "salary_to",
    }

"""Работа с вакансиями глубокий поиск"""
user_search_vacancies = {
    " 1.Название вакансии\n": "1",
    "2.Описание вакансии \n": "2",
    "3.Город\n": "3",
    "4.Название организации\n": "4",
    "5.Требования\n": "5"
    }
user_search_answers_vacancies = {
    "1": "name",
    "2": "responsibility",
    "3": "town",
    "4": "employer",
    "5": "requirement",
    }